int/resources/objectRepo/xmlTemplates/htng/HTNG2008BExt/req_FetchRoomStatus.xml

<soapenv:Envelope xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://webservices.micros.com/htng/2008B/SingleGuestItinerary/Housekeeping/Types">
   <soapenv:Header/>
   <soapenv:Body>
      <typ:FetchRoomStatusRequest>
         <typ:ResortId/>
         <typ:RoomType/>
         <typ:RoomNumber/>
      </typ:FetchRoomStatusRequest>
   </soapenv:Body>
</soapenv:Envelope>